In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('https://www.gairuo.com/file/data/dataset/team.xlsx')
s = df.Q1 # 取其中一列，形成Series
df.head() # 查看前5条数据

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24  64
1   Arry    C  36  37  37  57
2    Ack    A  57  60  18  84
3  Eorge    C  93  96  71  78
4    Oah    D  65  49  61  86

In [7]:
df.head(10) # 查看前10条数据

     name team  Q1  Q2  Q3  Q4
0   Liver    E  89  21  24  64
1    Arry    C  36  37  37  57
2     Ack    A  57  60  18  84
3   Eorge    C  93  96  71  78
4     Oah    D  65  49  61  86
5  Harlie    C  24  13  87  43
6    Acob    B  61  95  94   8
7    Lfie    A   9  10  99  37
8  Reddie    D  64  93  57  72
9   Oscar    A  77   9  26  67

In [8]:
s.tail() # 查看后5条数据

95    48
96    21
97    98
98    11
99    21
Name: Q1, dtype: int64

In [9]:
df.tail(10) # 查看后10条数据

        name team  Q1  Q2  Q3  Q4
90      Leon    E  38  60  31   7
91    Connor    C  62  38  63  46
92  Grayson7    B  59  84  74  33
93    Jamie0    B  39  97  84  55
94     Aiden    D  20  31  62  68
95   Gabriel    C  48  59  87  74
96   Austin7    C  21  31  30  43
97  Lincoln4    C  98  93   1  20
98       Eli    E  11  74  58  91
99       Ben    E  21  43  41  74

In [10]:
df.sample() # 随机查看一条数据

       name team  Q1  Q2  Q3  Q4
34  Reggie1    A  30  12  23   9

In [ ]:
s.sample(3) # 随机查看3条数据

In [15]:
df.info

<bound method DataFrame.info of         name team  Q1  Q2  Q3  Q4
0      Liver    E  89  21  24  64
1       Arry    C  36  37  37  57
2        Ack    A  57  60  18  84
3      Eorge    C  93  96  71  78
4        Oah    D  65  49  61  86
..       ...  ...  ..  ..  ..  ..
95   Gabriel    C  48  59  87  74
96   Austin7    C  21  31  30  43
97  Lincoln4    C  98  93   1  20
98       Eli    E  11  74  58  91
99       Ben    E  21  43  41  74

[100 rows x 6 columns]>

In [ ]:
df.shape

In [16]:
s.shape

(100,)

In [19]:
df.dtypes

name    object
team    object
Q1       int64
Q2       int64
Q3       int64
Q4       int64
dtype: object

In [18]:
s.dtypes

dtype('int64')

In [31]:
df.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['name', 'team', 'Q1', 'Q2', 'Q3', 'Q4'], dtype='object')]

In [29]:
df.describe()

               Q1          Q2          Q3          Q4
count  100.000000  100.000000  100.000000  100.000000
mean    49.200000   52.550000   52.670000   52.780000
std     29.962603   29.845181   26.543677   27.818524
min      1.000000    1.000000    1.000000    2.000000
25%     19.500000   26.750000   29.500000   29.500000
50%     51.500000   49.500000   55.000000   53.000000
75%     74.250000   77.750000   76.250000   75.250000
max     98.000000   99.000000   99.000000   99.000000

In [25]:
pd.Series(['a', 'b', 'c', 'c']).describe()

count     4
unique    3
top       c
freq      2
dtype: object

In [28]:
pd.Series(['a', 'b', 'c', 'a', 'a']).describe()

count     5
unique    3
top       a
freq      3
dtype: object